## Staging: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                     |
|--------|---------------------------------------------|
| add    | `aws_glue_trigger.submissions_glue_trigger` |
| update | `aws_glue_job.rds_glue_job`                 |
|        | `aws_glue_job.submissions_glue_job`         |
|        | `aws_s3_object.glue_script`                 |
|        | `aws_s3_object.submissions_glue_script`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_job.rds_glue_job will be updated in-place
  ~ resource "aws_glue_job" "rds_glue_job" {
      ~ default_arguments         = {
          - "--enable-job-insights"              = "true" -> null
          - "--job-language"                     = "python" -> null
            # (9 unchanged elements hidden)
        }
      - execution_class           = "STANDARD" -> null
        id                        = "rds_glue_job"
        name                      = "rds_glue_job"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.submissions_glue_job will be updated in-place
  ~ resource "aws_glue_job" "submissions_glue_job" {
      ~ default_arguments         = {
          ~ "--batch_size"                       = "all" -> "daily"
          - "--enable-job-insights"              = "true" -> null
          - "--job-language"                     = "python" -> null
            # (8 unchanged elements hidden)
        }
      - execution_class           = "STANDARD" -> null
        id                        = "submissions_glue_job"
        name                      = "submissions_glue_job"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_trigger.submissions_glue_trigger will be created
  + resource "aws_glue_trigger" "submissions_glue_trigger" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "submissions_glue_trigger"
      + schedule = "cron(0 0 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "submissions_glue_job"
        }
    }

  # aws_s3_object.glue_script will be updated in-place
  ~ resource "aws_s3_object" "glue_script" {
      ~ etag                          = "ae73882ac537ff31b1a344c7f911aa1c" -> "4811b33ecf052116725c0af20e97e2f0"
        id                            = "rds_etl.py"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      ~ version_id                    = "js2ZbXNFmwktkzOtnLOwr0flVaCd9.SI" -> (known after apply)
        # (22 unchanged attributes hidden)
    }

  # aws_s3_object.submissions_glue_script will be updated in-place
  ~ resource "aws_s3_object" "submissions_glue_script" {
        id                            = "submissions_etl.py"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.glue_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.rds_db_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_connection.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_historical_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_rds_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.historical_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.rds_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.submissions_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.rds_glue_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.submissions_glue_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3_replicate"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms_s3_replicate"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_csv"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.submissions_glue_script"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
